# Напишите функцию number_to_words(num), которая принимает
# в качестве аргумента натуральное число num и возвращает
# его словесное описание на русском языке.
#
# Примечание 1.
# Считайте, что число 1 ≤ num ≤ 99.
#
# Примечание 2.
# Следующий программный код:
#
# print(number_to_words(7))
# print(number_to_words(85))
# должен выводить:
#
# семь
# восемьдесят пять
def number_to_words(n, k, m):
    if n < 10:
        k = n% 10
        if k == 1:
            a = "один"
            return(a)
        if k == 2:
            b = "два"
            return(b)
        if k == 3:
            c = "три"
            return (c)
        if k == 4:
            d = "четыре"
            return (d)
        if k == 5:
            e = "пять"
            return (e)
        if k == 6:
            f = "шесть"
            return (f)
        if k == 7:
            g = "семь"
            return (g)
        if k == 8:
            e = "восемь"
            return (e)
        if k == 9:
            h = "девять"
            return (h)
    if 10<=n<20:
        if n ==11:
            m ="одиннадцать"
        if n ==12:
            m ="двенадцать"
        if n ==13:
            m ="тринадцать"
        if n ==14:
            m ="четырнадцать"
        if n ==15:
            m ="пятнадцать"
        if n ==16:
            m ="шестнадцать"
        if n ==17:
            m ="семнадцать"
        if n ==18:
            m ="восемнадцать"
        if n ==19:
            m ="девятнадцать"
        return(m)
    if n>=20:
        o ="двадцать"
        q ="тридцать"
        i ="сорок"
        j="пятьдесят"
        k="шестьдесят"
        l="семьдесят"
        p="восемдесят"
        n="девяносто"
        sos = n//10
        if sos==2:
            return(o)




n = int(input())
a = number_to_words(n, k, m)
